## Домашнее задание 1

### Задание 1

Напишите простое приложение для формирования списка продуктов.

Требования к приложению:

Все товары в списке должны быть уникальными. При попытке добавить уже имеющийся продукт необходимо выбросить исключение. Например, если в списке уже есть бананы, то второй раз добавить их нельзя.
Каждому продукту помимо названия можно добавить две характеристики: цена и необходимое количество, которое указывается в килограммах.
Если какой-то из параметров не заполнен, то программа должна выдавать ошибку и сообщение «Заполните карточку товара полностью».
В список продуктов можно добавить новый товар, отметить, что он уже куплен, или удалить его из списка.
Названия всех продуктов должны быть на русском языке.

Критерии проверки
- Создан класс Product.
- Создана коллекция, которая содержит в себе продукты.
- Коллекция удовлетворяет условиям задачи, где объекты не должны повторяться.
- Добавлены модификаторы доступа.
- Созданы геттеры и сеттеры для необходимых полей.
- Методы переопределены.
- Создано непроверяемое исключение, которое выбрасывает ошибку в случае, если в список добавляется уже имеющийся продукт.
- Создано непроверяемое исключение, которое выбрасывает ошибку в случае, если данные по объекту заполнены не полностью.

## Домашнее задание 2

### Задание 1

Вам необходимо усложнить задание со списком продуктов из прошлого урока. Создайте класс рецептов, который содержит поля:

Множество продуктов.
Суммарная стоимость всех продуктов у данного рецепта.
Название рецепта.
Создайте множество, в котором будут храниться все рецепты. Добавьте в него несколько рецептов.

Рецепты не могут иметь одинаковое название — при попытке добавить рецепт с уже занятыми названием необходимо выбросить исключение. Рецепты с разным названием, содержащие одинаковый список продуктов, считаются разными рецептами.

Критерии проверки
- Создан класс рецептов.
- Создана коллекция, которая содержит в себе рецепты.
- Класс рецептов должен быть неизменяемым (созданы только геттеры).
- Методы переопределены.
- Выбрасывается исключение при попытке добавить рецепт с названием, которое уже существует.
- Есть возможность добавить рецепты с разными названиями, но с одинаковым списком продуктов.


### Задание 2
Создайте множество целых чисел. Заполните множество 20 случайными числами в диапазоне от 0 до 1000.

Пройдитесь по всем элементам множества и удалите из него все нечетные значения. Выведите оставшиеся элементы в консоль.

Критерии проверки
- Создана коллекция, содержащая целые числа.
- Выбран нужный тип коллекции для решения задания.
- Множество заполнено случайными числами в указанном диапазоне.
- Удалены все нечетные числа.
- Все оставшиеся значения выводятся в консоль.

## Домашнее задание 3

### Задание 1
Вернемся к нашему приложению автогонок.

Ранее мы создали список списки автомобилей, спонсоров, механиков и водителей.

Перепишите приложение: если в случае ошибки какой-либо из объектов будет занесен в базу два раза, то в консоль выведется информация без повторов.

Критерии оценки
- Выбрана коллекция, которая удовлетворяет условиям: в списке спонсоров нет повторов.
- В консоль выводится информация о спонсорах без повтора.
- Выбрана коллекция, которая удовлетворяет условиям: в списке автомобилей нет повторов.
- Информация об автомобилях выводится в консоль без повтора.
- Выбрана коллекция, которая удовлетворяет условиям: в списке водителей нет повторов.
- В консоль выводится информация о водителях без повтора.
- Выбрана коллекция, которая удовлетворяет условиям: в списке механиков нет повторов.
- В консоль выводится информация о механиках без повтора.


### Задание 2

Учитель каждый урок начинает с того, чтобы задавать каждому ученику пример из таблицы умножения, чтобы проверить знания. Учитель хочет, чтобы все вопросы для учеников были разными. Всего в классе учатся 15 человек.

Напишите программу, которая будет выводить в консоль 15 уникальных и случайных задач из таблицы умножения в столбец, то есть на одной строчке одно задание (от 2*2 до 9*9). Задачи должны быть уникальными, то есть примеры по типу 2*9 и 9*2 считаются повтором.

Критерии оценки
- Создана коллекция, в которой хранится список задач.
- В консоль задачи выводятся в столбец, на каждой новой строчке новая задача.
- Исключены повторы заданий в списке.


### Задание 3

В некоторых гос. структурах многих стран есть возможность вбить номер паспорта и получить информацию о том, кому он принадлежит.

Напишите программу, которая содержит в себе упрощенный функционал этой системы.

Создайте класс Passport, содержащий в себе поля:

«Номер паспорта» (уникальное, неповторяющееся значение);
«Фамилия»;
«Имя»;
«Отчество» (если имеется; может быть пустым);
«Дата рождения».
Выберите структуру данных, подходящую для хранения и получения (по номеру паспорта) объектов класса Passport. Реализуйте 2 метода:

Принимает объект класса Passport и сохраняет его в коллекцию. В случае если в коллекции уже есть паспорт с данным номером, необходимо обновить остальные поля класса (фамилию, имя и т. д.)
Принимает номер паспорта, ищет в коллекции объект с данным номером и возвращает весь объект. Если объект не найден, возвращает null.

Критерии оценки
- Создан класс с указанными полями.
- Переопределены методы, если это необходимо.
- Все поля не могут быть null, кроме отчества.
- Выбрана верная коллекция.
- Метод сохранения корректно добавляет и обновляет данные.
- Метод получения объекта по номеру работает согласно условиям, не бросает исключения.


### Задание 4

Дан метод:

private void process(Collection<Integer> firstCollection, List<Integer> list) {
if (firstCollection.containsAll(list)) {
System.out.println("Первая коллекция содержит все элементы списка");
} else {
System.out.println("Некоторые (или все) элементы из списка отсутствуют в первой коллекции");
}
}
В качестве первого параметра метод может принять любую коллекцию (ArrayList, LinkedList, ArrayDeque, HashSet, TreeSet и т. д.)

Какой из этих коллекций понадобится меньше времени на выполнение данного метода при большом наборе данных? Почему?

ArrayList.
LinkedList.
HashSet.
Напишите, какую коллекцию стоит использовать, и объясните, почему именно ее. В качестве выполненного задания на платформу код присылать не нужно, только текстовое объяснение вашего решения.

Критерии оценки
- Выбрана верная коллекция.
- Ученик аргументировал свой выбор.